simulateOverSpeeds/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         230;

deltaT          0.3;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "streamLines"
    #include "cuttingPlane"
    #include "forceCoeffs"
    
    // This code might be based on a deprecated version
    valueAverageDrag
    {
        type valueAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl timeStep;
        
        functionObjectName forceCoeffs1;
        fields (Cd);
        window 50;
    }
    
    runTimeControl1
    {
        type runTimeControl;
        functionLibObjects ("libjobControl.so");
        
        conditions
        {
            average1
            {
                type average;
                functionObjectName valueAverageDrag;
                fields     (CdMean); // I think this line has potential to fail
                tolerance   1e-2;
                window 50;
            }
        
        }
    }
    
    /*yPlus1
    {
        type yPlus;
        libs
    }*/
}


// ************************************************************************* //
