simulateOverSpeeds/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

#include     "include/initialConditions"

dimensions   [0 2 -3 0 0 0 0];

internalField  uniform $epsilon;


boundaryField
{
    // Including extra stuff probably cant do any arm and I tink tis allows us to use noseConeroup
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
         type     inletOutlet;
         inletValue  $internalField;
         value       $internalField;
    }

    noseConeGroup
    {
         type    epsilonWallFunction;
         value   $internalField;
    }

    #include "include/airPatches"

}
