simulateOverSpeeds/0/include/airPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

lowerWall
{
	type slip;
}

frontAndBack
{
    type slip;
}

// ************************************************************************* //
