simulateOverSpeeds/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none; // Means that each one has to be specified
    // I think that Gauss linearUpwindV grad(U) is probably good enough
    div(phi,U)      Gauss linearUpwindV cellMDLimited Gauss linear 1; // bounded Gauss linearUpwindV grad(U); // bounded Gauss linear;
    // Supposedly upwind isn't very accurate
    div(phi,k)      bounded Gauss limitedLinear 1;
    div(phi,epsilon)      Gauss upwind;
    div(phi,omega)               bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    // This is assumes a pretty high quality mesh
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
